app/controllers/pages_controller.rb

  def index
    @gallery_images = GalleryImage.all
    @products = Product.all
---
SELECT "gallery_images".* FROM "gallery_images"
SELECT "products".* FROM "products"